# Pandas Day 3 loc iloc

In [1]:
import pandas as pd

In [2]:
d=pd.read_csv(r"C:\Users\Parimal\Downloads\used_bikes (1).csv")

In [3]:
d

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
144,Royal Enfield Standard 350cc,115000.0,Hyderabad,14900.0,First Owner,3.0,350.0,Royal Enfield
145,Honda CB Shine 125cc Disc,65000.0,Mumbai,2000.0,First Owner,3.0,125.0,Honda
146,Honda CB Unicorn ABS 150cc,99000.0,Mumbai,4000.0,First Owner,2.0,150.0,Honda
147,Yamaha YZF-R15 2.0 150cc,68500.0,Delhi,68500.0,Second Owner,7.0,150.0,Yamaha
148,Yamaha YZF-R15 V3 150cc,140000.0,Delhi,2473.0,First Owner,2.0,150.0,Yamaha

In [5]:
d.groupby("city").age.mean()

city
Agra             14.000000
Ahmedabad         7.750000
Allahabad         6.000000
Bagalkot          2.000000
Bangalore         4.777778
Barasat           5.000000
Baripara          4.000000
Chennai           4.000000
Delhi             5.783784
Dharwad           7.000000
Ernakulam         4.000000
Faridabad         5.500000
Gandhidham        4.000000
Ghaziabad         6.000000
Gorakhpur         5.500000
Gurgaon           5.000000
Hosur             5.000000
Hyderabad         5.833333
Jaipur            4.000000
Jalandhar        11.000000
Kaithal           4.000000
Kalyan            5.000000
Karnal            8.000000
Kochi             5.000000
Kolkata           6.000000
Lucknow          13.000000
Mettur            2.000000
Mumbai            4.842105
Nadiad            8.000000
Nashik            8.000000
Navi Mumbai       2.000000
Noida             7.000000
Pune              6.000000
Samastipur        2.000000
Surat             7.000000
Thrissur          3.000000
Vadodara          4.333333
Vidisha           9.000000
Visakhapatnam    13.000000
Name: age, dtype: float64

In [9]:
d.loc[d["city"]=="Hyderabad"]

,bike_name,price,city,kms_driven,owner,age,power,brand
30,Bajaj Pulsar NS200,88000.0,Hyderabad,21914.0,First Owner,3.0,200.0,Bajaj
41,Bajaj Avenger 220cc,45000.0,Hyderabad,36100.0,First Owner,6.0,220.0,Bajaj
68,Bajaj Pulsar 220cc,29500.0,Hyderabad,40700.0,First Owner,12.0,220.0,Bajaj
142,Bajaj Discover 150cc,36000.0,Hyderabad,39500.0,First Owner,7.0,150.0,Bajaj
143,Bajaj Avenger Street 220,72000.0,Hyderabad,29500.0,First Owner,4.0,220.0,Bajaj
144,Royal Enfield Standard 350cc,115000.0,Hyderabad,14900.0,First Owner,3.0,350.0,Royal Enfield

In [4]:
d1={"names":["a","a","b"],"age":[20,20,30]}
d1=pd.DataFrame(d1)
d1

  names  age
0     a   20
1     a   20
2     b   30

In [5]:
d1.drop_duplicates()

  names  age
0     a   20
2     b   30

In [6]:
d1=d1.drop_duplicates()

In [7]:
d1

  names  age
0     a   20
2     b   30

In [8]:
d1.rename(columns={"names":"new_names"})

  new_names  age
0         a   20
2         b   30

In [9]:
d1=d1.rename(columns={"names":"new_names"})
print(d1)

  new_names  age
0         a   20
2         b   30

In [10]:
d1

  new_names  age
0         a   20
2         b   30

In [11]:
d1.rename(columns={"new_names":"new_name_1"},inplace=True)

In [12]:
d1

  new_name_1  age
0          a   20
2          b   30

In [13]:
# Handling Missing / Null values

In [14]:
import numpy as np

d2={"names":["a","b","c","d"],"age":[20,20,30,np.nan]}
d2=pd.DataFrame(d2)
d2

  names   age
0     a  20.0
1     b  20.0
2     c  30.0
3     d   NaN

In [15]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes

In [16]:
d2["age"].mean()

23.333333333333332

In [17]:
d2["age"].fillna(d2["age"].mean(),inplace=True)

In [18]:
d2

  names        age
0     a  20.000000
1     b  20.000000
2     c  30.000000
3     d  23.333333

In [19]:
d2={"names":["a","b","c","d"],"age":[20,20,30,np.nan]}
d2=pd.DataFrame(d2)
d2

  names   age
0     a  20.0
1     b  20.0
2     c  30.0
3     d   NaN

In [20]:
d2["age"].fillna(d2["age"].sum(),inplace=True)

In [21]:
d2

  names   age
0     a  20.0
1     b  20.0
2     c  30.0
3     d  70.0

In [31]:
d2={"names":["a","b","c","d"],"age":[20,20,30,np.nan]}
d2=pd.DataFrame(d2)
d2

  names   age
0     a  20.0
1     b  20.0
2     c  30.0
3     d   NaN

In [32]:
#drop na
d2.dropna()

  names   age
0     a  20.0
1     b  20.0
2     c  30.0

In [22]:
# Adding and Removing columns

In [23]:
d2.drop("age",axis=1,inplace=True)
d2

  names
0     a
1     b
2     c
3     d

In [24]:
#
d2["Age"]=[20,20,30,40]
d2

  names  Age
0     a   20
1     b   20
2     c   30
3     d   40

In [25]:
d2.drop("Age",axis=1,inplace=True)
d2

  names
0     a
1     b
2     c
3     d

In [26]:
#
d2["Age"]=[20,20,30,40]
d2

  names  Age
0     a   20
1     b   20
2     c   30
3     d   40

In [27]:
d2["Date"]=[2001,2002,2003,2004]
d2

  names  Age  Date
0     a   20  2001
1     b   20  2002
2     c   30  2003
3     d   40  2004

In [28]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   Age     4 non-null      int64
 2   Date    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [29]:
d2["Date"]=pd.to_datetime(d2["Date"])

In [30]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   Age     4 non-null      int64
 2   Date    4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 224.0+ bytes